Revit 2027 API
MacroModule.MacroLanguageType Property
 The Macro language type.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MacroLanguageType MacroLanguageType { get; }
Public ReadOnly Property MacroLanguageType As MacroLanguageType
	Get
public:
property MacroLanguageType MacroLanguageType {
	MacroLanguageType get ();
}
member MacroLanguageType : MacroLanguageType with get
Property Value
MacroLanguageType
See Also
Reference
MacroModule Class
Autodesk.Revit.DB.Macros Namespace